merge: mergin index.html changes
